kampfhamster309/dsp_embedded/sdkconfig.defaults
# DSP Embedded – sdkconfig defaults for ESP32-S3
# Apply with: idf.py -DSDKCONFIG_DEFAULTS=sdkconfig.defaults reconfigure

# Target
CONFIG_IDF_TARGET="esp32s3"

# Partition table
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# Flash
CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y
CONFIG_ESPTOOLPY_FLASHSIZE="4MB"
CONFIG_ESPTOOLPY_FLASHFREQ_80M=y
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y

# CPU frequency
CONFIG_ESP32S3_DEFAULT_CPU_FREQ_240=y

# PSRAM – disabled by default, enable via CONFIG_DSP_PSRAM_ENABLE
CONFIG_ESP32S3_SPIRAM_SUPPORT=n

# FreeRTOS
CONFIG_FREERTOS_HZ=1000
CONFIG_FREERTOS_UNICORE=n

# Logging
CONFIG_LOG_DEFAULT_LEVEL_INFO=y

# Stack sizes
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192

# NVS encryption – off by default (key provisioned separately)
CONFIG_NVS_ENCRYPTION=n

# Reduce mbedTLS footprint (further tuned in DSP-101)
CONFIG_MBEDTLS_CERTIFICATE_BUNDLE=n
CONFIG_MBEDTLS_ASYMMETRIC_CONTENT_LEN=y
CONFIG_MBEDTLS_SSL_IN_CONTENT_LEN=4096
CONFIG_MBEDTLS_SSL_OUT_CONTENT_LEN=4096

# Watchdog
CONFIG_ESP_TASK_WDT_EN=y
CONFIG_ESP_TASK_WDT_TIMEOUT_S=30
